tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'

# Desktop
cask 'appcleaner'
cask 'bitwarden'
cask 'brave-browser'
cask 'breaktimer'
cask 'cyberduck'
cask 'github'
cask 'httpie'
cask 'iterm2'
cask 'krita'
cask 'maccy'
cask 'sublime-text'
cask 'the-unarchiver'
cask 'visual-studio-code'
cask 'vlc'
cask 'wireshark'

# Infrastructure
brew 'awscli'
cask 'docker'
brew 'squid'
cask 'vagrant'

# Shell
cask 'font-fira-code-nerd-font'
brew 'act'
brew 'bfg'
brew 'bitwarden-cli'
brew 'coreutils'
brew 'git'
brew 'gnu-sed'
brew 'gnu-tar'
brew 'gpg'
brew 'htop'
brew 'httpie'
brew 'jq'
brew 'mtr'
brew 'nmap'
brew 'pinentry-mac'
brew 'pwgen'
brew 'rename'
brew 'ripgrep'
brew 'stow'
brew 'starship'
brew 'telnet'
brew 'watch'
brew 'wget'
brew 'zsh'
brew 'zsh-autosuggestions'
brew 'zsh-completions'
brew 'zsh-syntax-highlighting'

# pyenv dependencies
brew 'openssl'
brew 'readline'
brew 'sqlite3'
brew 'xz'
brew 'zlib'

# Languages
brew 'asdf'
brew 'npm'
brew 'pipx'
brew 'tfenv'

# Code quality
brew 'ansible-lint'
brew 'black'
brew 'hadolint'
brew 'shellcheck'
brew 'write-good'
brew 'yamllint'
